cache/redis-persistence-recovery/evidence/bench-aof-always-c1.txt
====== SET ======
  40000 requests completed in 11.16 seconds
  1 parallel clients
  64 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.215 milliseconds (cumulative count 2)
50.000% <= 0.271 milliseconds (cumulative count 24793)
75.000% <= 0.287 milliseconds (cumulative count 33393)
87.500% <= 0.295 milliseconds (cumulative count 35509)
93.750% <= 0.319 milliseconds (cumulative count 37848)
96.875% <= 0.359 milliseconds (cumulative count 38797)
98.438% <= 0.407 milliseconds (cumulative count 39405)
99.219% <= 0.479 milliseconds (cumulative count 39688)
99.609% <= 0.615 milliseconds (cumulative count 39844)
99.805% <= 0.831 milliseconds (cumulative count 39922)
99.902% <= 1.207 milliseconds (cumulative count 39962)
99.951% <= 1.679 milliseconds (cumulative count 39981)
99.976% <= 3.367 milliseconds (cumulative count 39991)
99.988% <= 3.767 milliseconds (cumulative count 39996)
99.994% <= 4.807 milliseconds (cumulative count 39998)
99.997% <= 5.095 milliseconds (cumulative count 39999)
99.998% <= 5.831 milliseconds (cumulative count 40000)
100.000% <= 5.831 milliseconds (cumulative count 40000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
91.732% <= 0.303 milliseconds (cumulative count 36693)
98.513% <= 0.407 milliseconds (cumulative count 39405)
99.332% <= 0.503 milliseconds (cumulative count 39733)
99.600% <= 0.607 milliseconds (cumulative count 39840)
99.713% <= 0.703 milliseconds (cumulative count 39885)
99.785% <= 0.807 milliseconds (cumulative count 39914)
99.820% <= 0.903 milliseconds (cumulative count 39928)
99.865% <= 1.007 milliseconds (cumulative count 39946)
99.880% <= 1.103 milliseconds (cumulative count 39952)
99.905% <= 1.207 milliseconds (cumulative count 39962)
99.920% <= 1.303 milliseconds (cumulative count 39968)
99.933% <= 1.407 milliseconds (cumulative count 39973)
99.938% <= 1.503 milliseconds (cumulative count 39975)
99.948% <= 1.607 milliseconds (cumulative count 39979)
99.953% <= 1.703 milliseconds (cumulative count 39981)
99.960% <= 1.807 milliseconds (cumulative count 39984)
99.963% <= 2.007 milliseconds (cumulative count 39985)
99.975% <= 3.103 milliseconds (cumulative count 39990)
99.990% <= 4.103 milliseconds (cumulative count 39996)
99.997% <= 5.103 milliseconds (cumulative count 39999)
100.000% <= 6.103 milliseconds (cumulative count 40000)

Summary:
  throughput summary: 3583.59 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.275     0.208     0.271     0.327     0.455     5.831