cache/redis-persistence-recovery/evidence/bench-aof-always-c32.txt
====== SET ======
  40000 requests completed in 0.80 seconds
  32 parallel clients
  64 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.295 milliseconds (cumulative count 2)
50.000% <= 0.615 milliseconds (cumulative count 20769)
75.000% <= 0.663 milliseconds (cumulative count 30389)
87.500% <= 0.703 milliseconds (cumulative count 35412)
93.750% <= 0.735 milliseconds (cumulative count 37508)
96.875% <= 0.783 milliseconds (cumulative count 38761)
98.438% <= 0.855 milliseconds (cumulative count 39397)
99.219% <= 0.951 milliseconds (cumulative count 39697)
99.609% <= 1.039 milliseconds (cumulative count 39845)
99.805% <= 1.143 milliseconds (cumulative count 39922)
99.902% <= 1.543 milliseconds (cumulative count 39961)
99.951% <= 3.399 milliseconds (cumulative count 39981)
99.976% <= 3.439 milliseconds (cumulative count 39992)
99.988% <= 3.463 milliseconds (cumulative count 39996)
99.994% <= 3.487 milliseconds (cumulative count 39998)
99.997% <= 3.495 milliseconds (cumulative count 39999)
99.998% <= 3.503 milliseconds (cumulative count 40000)
100.000% <= 3.503 milliseconds (cumulative count 40000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.020% <= 0.303 milliseconds (cumulative count 8)
9.170% <= 0.407 milliseconds (cumulative count 3668)
12.252% <= 0.503 milliseconds (cumulative count 4901)
47.510% <= 0.607 milliseconds (cumulative count 19004)
88.530% <= 0.703 milliseconds (cumulative count 35412)
97.635% <= 0.807 milliseconds (cumulative count 39054)
98.955% <= 0.903 milliseconds (cumulative count 39582)
99.498% <= 1.007 milliseconds (cumulative count 39799)
99.752% <= 1.103 milliseconds (cumulative count 39901)
99.845% <= 1.207 milliseconds (cumulative count 39938)
99.858% <= 1.407 milliseconds (cumulative count 39943)
99.892% <= 1.503 milliseconds (cumulative count 39957)
99.918% <= 1.607 milliseconds (cumulative count 39967)
99.922% <= 1.703 milliseconds (cumulative count 39969)
100.000% <= 4.103 milliseconds (cumulative count 40000)

Summary:
  throughput summary: 50314.46 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.605     0.288     0.615     0.751     0.911     3.503