cache/redis-persistence-recovery/evidence/bench-aof-everysec-c1.txt
====== SET ======
  40000 requests completed in 1.92 seconds
  1 parallel clients
  64 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.015 milliseconds (cumulative count 1697)
50.000% <= 0.047 milliseconds (cumulative count 33863)
87.500% <= 0.055 milliseconds (cumulative count 38950)
98.438% <= 0.063 milliseconds (cumulative count 39581)
99.219% <= 0.071 milliseconds (cumulative count 39783)
99.609% <= 0.079 milliseconds (cumulative count 39859)
99.805% <= 0.095 milliseconds (cumulative count 39923)
99.902% <= 0.127 milliseconds (cumulative count 39964)
99.951% <= 0.151 milliseconds (cumulative count 39984)
99.976% <= 0.199 milliseconds (cumulative count 39991)
99.988% <= 0.463 milliseconds (cumulative count 39996)
99.994% <= 0.511 milliseconds (cumulative count 39998)
99.997% <= 0.567 milliseconds (cumulative count 39999)
99.998% <= 0.767 milliseconds (cumulative count 40000)
100.000% <= 0.767 milliseconds (cumulative count 40000)

Cumulative distribution of latencies:
99.835% <= 0.103 milliseconds (cumulative count 39934)
99.980% <= 0.207 milliseconds (cumulative count 39992)
99.985% <= 0.303 milliseconds (cumulative count 39994)
99.987% <= 0.407 milliseconds (cumulative count 39995)
99.990% <= 0.503 milliseconds (cumulative count 39996)
99.997% <= 0.607 milliseconds (cumulative count 39999)
100.000% <= 0.807 milliseconds (cumulative count 40000)

Summary:
  throughput summary: 20800.83 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.044     0.008     0.047     0.055     0.071     0.767