cache/redis-persistence-recovery/evidence/bench-aof-everysec-c32.txt
====== SET ======
  40000 requests completed in 0.21 seconds
  32 parallel clients
  64 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.031 milliseconds (cumulative count 1)
50.000% <= 0.087 milliseconds (cumulative count 24522)
75.000% <= 0.103 milliseconds (cumulative count 31303)
87.500% <= 0.127 milliseconds (cumulative count 35043)
93.750% <= 0.143 milliseconds (cumulative count 38229)
96.875% <= 0.151 milliseconds (cumulative count 38850)
98.438% <= 0.167 milliseconds (cumulative count 39453)
99.219% <= 0.183 milliseconds (cumulative count 39719)
99.609% <= 0.207 milliseconds (cumulative count 39870)
99.805% <= 0.231 milliseconds (cumulative count 39932)
99.902% <= 0.263 milliseconds (cumulative count 39962)
99.951% <= 0.495 milliseconds (cumulative count 39981)
99.976% <= 0.543 milliseconds (cumulative count 39991)
99.988% <= 0.607 milliseconds (cumulative count 39996)
99.994% <= 0.639 milliseconds (cumulative count 39998)
99.997% <= 0.647 milliseconds (cumulative count 39999)
99.998% <= 0.671 milliseconds (cumulative count 40000)
100.000% <= 0.671 milliseconds (cumulative count 40000)

Cumulative distribution of latencies:
78.258% <= 0.103 milliseconds (cumulative count 31303)
99.675% <= 0.207 milliseconds (cumulative count 39870)
99.920% <= 0.303 milliseconds (cumulative count 39968)
99.928% <= 0.407 milliseconds (cumulative count 39971)
99.957% <= 0.503 milliseconds (cumulative count 39983)
99.990% <= 0.607 milliseconds (cumulative count 39996)
100.000% <= 0.703 milliseconds (cumulative count 40000)

Summary:
  throughput summary: 187793.42 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.094     0.024     0.087     0.143     0.175     0.671