cache/redis-persistence-recovery/evidence/bench-aof-no-c1.txt
====== SET ======
  40000 requests completed in 1.96 seconds
  1 parallel clients
  64 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.015 milliseconds (cumulative count 1309)
50.000% <= 0.047 milliseconds (cumulative count 32954)
87.500% <= 0.055 milliseconds (cumulative count 38593)
96.875% <= 0.063 milliseconds (cumulative count 39395)
99.219% <= 0.071 milliseconds (cumulative count 39696)
99.609% <= 0.087 milliseconds (cumulative count 39857)
99.805% <= 0.111 milliseconds (cumulative count 39933)
99.902% <= 0.135 milliseconds (cumulative count 39962)
99.951% <= 0.159 milliseconds (cumulative count 39981)
99.976% <= 0.255 milliseconds (cumulative count 39993)
99.988% <= 0.311 milliseconds (cumulative count 39996)
99.994% <= 0.559 milliseconds (cumulative count 39998)
99.997% <= 0.575 milliseconds (cumulative count 39999)
99.998% <= 0.735 milliseconds (cumulative count 40000)
100.000% <= 0.735 milliseconds (cumulative count 40000)

Cumulative distribution of latencies:
99.780% <= 0.103 milliseconds (cumulative count 39912)
99.972% <= 0.207 milliseconds (cumulative count 39989)
99.985% <= 0.303 milliseconds (cumulative count 39994)
99.992% <= 0.407 milliseconds (cumulative count 39997)
99.997% <= 0.607 milliseconds (cumulative count 39999)
100.000% <= 0.807 milliseconds (cumulative count 40000)

Summary:
  throughput summary: 20418.58 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.045     0.008     0.047     0.055     0.071     0.735