cache/redis-persistence-recovery/evidence/bench-aof-no-c32.txt
====== SET ======
  40000 requests completed in 0.20 seconds
  32 parallel clients
  64 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.031 milliseconds (cumulative count 1)
50.000% <= 0.087 milliseconds (cumulative count 29650)
75.000% <= 0.095 milliseconds (cumulative count 33691)
87.500% <= 0.103 milliseconds (cumulative count 35278)
93.750% <= 0.127 milliseconds (cumulative count 37559)
96.875% <= 0.143 milliseconds (cumulative count 39180)
98.438% <= 0.151 milliseconds (cumulative count 39464)
99.219% <= 0.167 milliseconds (cumulative count 39733)
99.609% <= 0.191 milliseconds (cumulative count 39874)
99.805% <= 0.215 milliseconds (cumulative count 39923)
99.902% <= 0.263 milliseconds (cumulative count 39963)
99.951% <= 0.303 milliseconds (cumulative count 39981)
99.976% <= 0.343 milliseconds (cumulative count 39992)
99.988% <= 0.375 milliseconds (cumulative count 39998)
99.997% <= 0.391 milliseconds (cumulative count 39999)
99.998% <= 0.415 milliseconds (cumulative count 40000)
100.000% <= 0.415 milliseconds (cumulative count 40000)

Cumulative distribution of latencies:
88.195% <= 0.103 milliseconds (cumulative count 35278)
99.775% <= 0.207 milliseconds (cumulative count 39910)
99.953% <= 0.303 milliseconds (cumulative count 39981)
99.997% <= 0.407 milliseconds (cumulative count 39999)
100.000% <= 0.503 milliseconds (cumulative count 40000)

Summary:
  throughput summary: 201005.03 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.088     0.024     0.087     0.135     0.159     0.415